src/test/resources/sample-requests/IF10_ProjectIdDimension_REQUEST.XML

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://schemas.microsoft.com/dynamics/2008/01/services" xmlns:quer="http://schemas.microsoft.com/dynamics/2006/02/documents/QueryCriteria">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:DimensionsServiceFindRequest>
         <!--Optional:-->
         <quer:QueryCriteria>
            <quer:CriteriaElement>
               <quer:DataSourceName>Dimension</quer:DataSourceName>
               <quer:FieldName>DimensionCode</quer:FieldName>
               <quer:Operator>Equal</quer:Operator>
               <quer:Value1>ProjectId</quer:Value1>
               
            </quer:CriteriaElement>
         </quer:QueryCriteria>
      </ser:DimensionsServiceFindRequest>
   </soapenv:Body>
</soapenv:Envelope>